package function

// функция - часть кода, представляющая собой блок операторов, которые выполняют задачи.

//    функция объявляется с помощью синтаксиса:                               func hello (){
//    func имя_функции (список_параметров) (типы_возвращаемых_значений){         fmt.Println("hello world")
//    выполняемые_операторы														}
//    }

//  объявление функции ----- func Intn(n int) int

//  использование функции -------num := rand.Intn(10)

// функция принимает аргументы в скобках, с указанием типа данных. После этого указывается тип аозвращаемых данных. Затем код функции.
// Если фукнция возвращает какое-то значение, то вконце кода необходимо указать оператор return. Без него программа не скомпилируется.

// аргументы в функции передаются по значению.
// для определения параметров, когда количество принимаемых аргументов неизвестно, перед типом аргументов ставится троеточие ...int
